# print("문자를 뒤에서부터 선택해 볼까요?")
# print("안녕하세요"[-4])
# print("안녕하세요"[-5])
print()
# print(len("안녕하세요"))

# print("-" * 8)
# print("/////")
# print("# 연습문제")

# print("안녕하세요"[1:3])
# print("안녕하세요"[2:4])
# print("안녕하세요"[1:])
# print("안녕하세요"[:3])

# print(type(52.5))

# print("5 + 7 =", 5 + 7)
# print("5 * 7 =", 5 * 7)
# print("5 - 7 =", 5 - 7)
# print("5 / 7 =", 5 / 7 ,type(5 / 7))

# print("7 // 5 =", 7 // 5 ,type(7// 5))
# print("7 % 5 =", 7 % 5 ,type(7 % 5))
print("문자열과 숫자의 덧셈은 불가능합니다.")  

print("5 % 2 = ", 5 % 2)
print()
print("2 ** 1 =", 2 ** 1)
print("2 ** 2 =", 2 ** 2)
print("2 ** 3 =", 2 ** 3)
print("2 ** 4 =", 2 ** 4)    
print("2 ** 5 =", 2 ** 5)

print('안녕' + ('하세요' * 3  ))